Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_security_group_rule.db-all has been changed
~ resource "aws_security_group_rule" "db-all" {
        id                = "sgrule-2283678397"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }
  # aws_lambda_function.main has been changed
~ resource "aws_lambda_function" "main" {
        id                             = "comentarios-api"
      ~ last_modified                  = "2021-08-09T07:26:39.561+0000" -> "2021-08-09T07:39:08.882+0000"
      ~ source_code_hash               = "i1aN+88ZNn91MEycPiDKJQLxq+cpcRX9JE5o/Ylg9bw=" -> "6oNfVMiu4Rzrj/re7gF1Dlb/pwc8CW5EcFSFd4fN8pM="
      ~ source_code_size               = 30289799 -> 30289644
        tags                           = {}
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # module.rds.aws_db_instance.rds has been changed
~ resource "aws_db_instance" "rds" {
        id                                    = "comentarios-api-production-rds01"
      ~ latest_restorable_time                = "2021-08-09T07:25:00Z" -> "2021-08-09T07:35:00Z"
        name                                  = ""
      ~ publicly_accessible                   = false -> true
        tags                                  = {
            "Environment" = "production"
            "Name"        = "comentarios-api-production-rds01"
            "Project"     = "comentarios-api"
        }
        # (55 unchanged attributes hidden)
    }
  # module.rds.aws_security_group.sg_rds has been changed
~ resource "aws_security_group" "sg_rds" {
        id                     = "sg-014ac24e2e3545e4e"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
            },
            # (1 unchanged element hidden)
        ]
        name                   = "comentarios-api-production"
        tags                   = {
            "Environment" = "production"
            "Name"        = "comentarios-api-production"
            "Project"     = "comentarios-api"
        }
        # (7 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_deployment.api will be created
+ resource "aws_api_gateway_deployment" "api" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "n1fiynim17"
    }

  # aws_api_gateway_stage.api will be created
+ resource "aws_api_gateway_stage" "api" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "n1fiynim17"
      + stage_name    = "api"
      + tags_all      = (known after apply)
    }

  # module.rds.aws_db_instance.rds will be updated in-place
~ resource "aws_db_instance" "rds" {
        id                                    = "comentarios-api-production-rds01"
        name                                  = ""
      ~ publicly_accessible                   = true -> false
        tags                                  = {
            "Environment" = "production"
            "Name"        = "comentarios-api-production-rds01"
            "Project"     = "comentarios-api"
        }
        # (56 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.weploy.com.br/lock?id=alsofer%252Fcomentarios-api-infra%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 2 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
